# PlayWrite INI for LOTRO english and german

[System]
# List of locales PlayWrite has been localized to in AHK DropDown format
SysLocales=English||Deutsch
# Identifier of PlayWrite-server within control-channel and logfile
cfDirector=Director
# Identifier of comment lines in plays (*.pwt)
pwt_Comment=^#
# String to send to target system before text in AHK format
com_PreOut={Enter}
# String to send to target system after text in AHK format
com_PostOut={Enter}
# Default pause for every line send to target system
com_DefPauseEOL=1200
# Regexp cleaning lines from logfile PWT
cfLineCleanPWT=^.+?\].+?\: (.+)
# Regexp cleaning lines from logfile QWT
cfLineCleanQWT=^([^\s]+).*'(.*)'
# Regexp cleaning lines from logfile QWT-loot
cfLineCleanQWTloot=^([^\s]+).*\[(.*)\]\.
# Timer for polling for new lines in logfile
cfFilePollTime=300
# Identify empty lines in the command-logfile
idComLogEmptyLine=(*ANYCRLF)^\s*$
# Identify, get and cut timestamp from command-logfile
idTimestamp=^\[\d\d\/\d\d\s(\d\d):(\d\d):(\d\d)\s(\w\w)\]\s

[English]
# Identifying part of windows name of target system
com_WinOutput=Lord of the Rings Online
# Pretext for putting out 'spoken' lines, including trailing space, through target system.
com_Channel=/say
# Pretext for sending PlayWrite control communication through target system.
pwt_Channel=/f
# Following lines for additional chat-commands within the target system
com_Say=/say
com_Regional=/regional
com_Dmsg=/t
com_Invite=/invite
freemote=em
musicon=music
musicoff=music off
playabc=play
playstart=playstart

[Deutsch]
com_WinOutput=Herr der Ringe Online
com_Channel=/sagen
pwt_Channel=/g
com_Say=/sagen
com_Regional=/regional
com_Dmsg=/f
com_Invite=/einladen
freemote=emote
musicon=musik
musicoff=musik aus
playabc=spielen
playstart=spielstart
# Following are fix names of loot which need to be localized
catfish=zwergwels
dace=weissfisch
minnow=elritze
# Following are fix emotes which need to be localized
burp=rülpsen
cheer=jubeln
dance=tanzen
yes=ja
ahem=ähem
story=geschichte
hug=umarmen
shrug=achselzucken
confused=verwirrt
impatient=ungeduldig
grumble=motzen
no=nein
fidget=zappeln
whippitydo=ohwietoll
clap=klatschen
challenge=herausfordern
salute=salutieren
crazy=verrückt
resist=widerstehen
smackhead=stirnschlag
mourn=trauern
flex=muskelspiel
congratulate=gratulieren
tantrum=wutanfall
scold=ausschimpfen
shakefist=faustschütteln
beg=flehen
ready=bereit
fight=streiten
sorry=entschuldigen
succumb=verzweifeln
cower=kauern
wince=zusammenzucken
cry=heul
cough=hüsteln
rest=ausruhen
roar=brüllen
point=zeigen
think=nachdenken
